lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_regs.h
#pragma once

#include <stdint.h>
#include <nrf54l15.h>

namespace nrf54l15 {

inline volatile uint32_t& reg32(uint32_t addr) {
  return *reinterpret_cast<volatile uint32_t*>(addr);
}

// Use the Arduino core address selection (secure/non-secure) from nrf54l15.h.
constexpr uint32_t GPIO_P0_BASE = static_cast<uint32_t>(NRF_P0_BASE);
constexpr uint32_t GPIO_P1_BASE = static_cast<uint32_t>(NRF_P1_BASE);
constexpr uint32_t GPIO_P2_BASE = static_cast<uint32_t>(NRF_P2_BASE);

constexpr uint32_t KMU_BASE = static_cast<uint32_t>(NRF_KMU_BASE);
constexpr uint32_t RRAMC_BASE = static_cast<uint32_t>(NRF_RRAMC_BASE);
constexpr uint32_t SPIM00_BASE = static_cast<uint32_t>(NRF_SPIM00_BASE);
constexpr uint32_t UARTE00_BASE = static_cast<uint32_t>(NRF_UARTE00_BASE);
constexpr uint32_t SPIM20_BASE = static_cast<uint32_t>(NRF_SPIM20_BASE);
constexpr uint32_t TWIM20_BASE = static_cast<uint32_t>(NRF_TWIM20_BASE);
constexpr uint32_t TWIS20_BASE = static_cast<uint32_t>(NRF_TWIS20_BASE);
constexpr uint32_t UARTE20_BASE = static_cast<uint32_t>(NRF_UARTE20_BASE);
constexpr uint32_t TWIM21_BASE = static_cast<uint32_t>(NRF_TWIM21_BASE);
constexpr uint32_t TWIS21_BASE = static_cast<uint32_t>(NRF_TWIS21_BASE);
constexpr uint32_t UARTE21_BASE = static_cast<uint32_t>(NRF_UARTE21_BASE);
// SPIM, SPIS, and TWIM/UARTE share serial fabric instances on this SoC family.
constexpr uint32_t SPIM21_BASE = static_cast<uint32_t>(NRF_TWIM21_BASE);
constexpr uint32_t SPIM22_BASE = static_cast<uint32_t>(NRF_SPIM22_BASE);
constexpr uint32_t SPIS22_BASE = static_cast<uint32_t>(NRF_SPIS22_BASE);
constexpr uint32_t TWIM22_BASE = static_cast<uint32_t>(NRF_TWIM22_BASE);
constexpr uint32_t TWIS22_BASE = static_cast<uint32_t>(NRF_TWIS22_BASE);
constexpr uint32_t UARTE22_BASE = static_cast<uint32_t>(NRF_UARTE22_BASE);
constexpr uint32_t SPIM30_BASE = static_cast<uint32_t>(NRF_SPIM30_BASE);
constexpr uint32_t SPIS30_BASE = static_cast<uint32_t>(NRF_SPIS30_BASE);
constexpr uint32_t TWIM30_BASE = static_cast<uint32_t>(NRF_TWIM30_BASE);
constexpr uint32_t TWIS30_BASE = static_cast<uint32_t>(NRF_TWIS30_BASE);
constexpr uint32_t UARTE30_BASE = static_cast<uint32_t>(NRF_UARTE30_BASE);
constexpr uint32_t EGU10_BASE = static_cast<uint32_t>(NRF_EGU10_BASE);
constexpr uint32_t EGU20_BASE = static_cast<uint32_t>(NRF_EGU20_BASE);
constexpr uint32_t SAADC_BASE = static_cast<uint32_t>(NRF_SAADC_BASE);
constexpr uint32_t I2S20_BASE = static_cast<uint32_t>(NRF_I2S20_BASE);
constexpr uint32_t PDM20_BASE = static_cast<uint32_t>(NRF_PDM20_BASE);
constexpr uint32_t PDM21_BASE = static_cast<uint32_t>(NRF_PDM21_BASE);
constexpr uint32_t PWM20_BASE = static_cast<uint32_t>(NRF_PWM20_BASE);
constexpr uint32_t PWM21_BASE = static_cast<uint32_t>(NRF_PWM21_BASE);
constexpr uint32_t PWM22_BASE = static_cast<uint32_t>(NRF_PWM22_BASE);
constexpr uint32_t OSCILLATORS_BASE = static_cast<uint32_t>(NRF_OSCILLATORS_BASE);
constexpr uint32_t CLOCK_BASE = static_cast<uint32_t>(NRF_CLOCK_BASE);
constexpr uint32_t NFCT_BASE = static_cast<uint32_t>(NRF_NFCT_BASE);
constexpr uint32_t FICR_BASE = 0x00FFC000UL;

#ifdef NRF_TRUSTZONE_NONSECURE
constexpr uint32_t COMP_BASE = 0x40106000UL;
constexpr uint32_t LPCOMP_BASE = 0x40106000UL;
constexpr uint32_t DPPIC10_BASE = 0x40082000UL;
constexpr uint32_t DPPIC20_BASE = 0x400C2000UL;
constexpr uint32_t DPPIC30_BASE = 0x40102000UL;
constexpr uint32_t PPIB11_BASE = 0x40084000UL;
constexpr uint32_t PPIB21_BASE = 0x400C4000UL;
constexpr uint32_t PPIB22_BASE = 0x400C5000UL;
constexpr uint32_t PPIB30_BASE = 0x40103000UL;
constexpr uint32_t AAR00_BASE = 0x40046000UL;
constexpr uint32_t CCM00_BASE = 0x40046000UL;
constexpr uint32_t ECB00_BASE = 0x40047000UL;
constexpr uint32_t CRACEN_BASE = 0x50048000UL;
constexpr uint32_t CRACENCORE_BASE = 0x51800000UL;
constexpr uint32_t SPIS00_BASE = 0x4004A000UL;
constexpr uint32_t SPIS20_BASE = 0x400C6000UL;
constexpr uint32_t QDEC20_BASE = 0x400E0000UL;
constexpr uint32_t QDEC21_BASE = 0x400E1000UL;
constexpr uint32_t SPIS21_BASE = 0x400C7000UL;
constexpr uint32_t TIMER21_BASE = 0x400CB000UL;
constexpr uint32_t TIMER22_BASE = 0x400CC000UL;
constexpr uint32_t TIMER23_BASE = 0x400CD000UL;
constexpr uint32_t TIMER24_BASE = 0x400CE000UL;
constexpr uint32_t TIMER10_BASE = 0x40085000UL;
constexpr uint32_t TIMER20_BASE = 0x400CA000UL;
constexpr uint32_t GPIOTE20_BASE = 0x400DA000UL;
constexpr uint32_t GPIOTE30_BASE = 0x4010C000UL;
constexpr uint32_t TEMP_BASE = 0x400D7000UL;
constexpr uint32_t RADIO_BASE = 0x4008A000UL;
constexpr uint32_t MEMCONF_BASE = 0x400CF000UL;
constexpr uint32_t GRTC_BASE = 0x400E2000UL;
constexpr uint32_t TAMPC_BASE = 0x00000000UL;
constexpr uint32_t WDT31_BASE = 0x40109000UL;
constexpr uint32_t POWER_BASE = 0x4010E000UL;
constexpr uint32_t RESET_BASE = 0x4010E000UL;
constexpr uint32_t REGULATORS_BASE = 0x40120000UL;
#else
constexpr uint32_t COMP_BASE = 0x50106000UL;
constexpr uint32_t LPCOMP_BASE = 0x50106000UL;
constexpr uint32_t DPPIC10_BASE = 0x50082000UL;
constexpr uint32_t DPPIC20_BASE = 0x500C2000UL;
constexpr uint32_t DPPIC30_BASE = 0x50102000UL;
constexpr uint32_t PPIB11_BASE = 0x50084000UL;
constexpr uint32_t PPIB21_BASE = 0x500C4000UL;
constexpr uint32_t PPIB22_BASE = 0x500C5000UL;
constexpr uint32_t PPIB30_BASE = 0x50103000UL;
constexpr uint32_t AAR00_BASE = 0x50046000UL;
constexpr uint32_t CCM00_BASE = 0x50046000UL;
constexpr uint32_t ECB00_BASE = 0x50047000UL;
constexpr uint32_t CRACEN_BASE = 0x50048000UL;
constexpr uint32_t CRACENCORE_BASE = 0x51800000UL;
constexpr uint32_t SPIS00_BASE = 0x5004A000UL;
constexpr uint32_t SPIS20_BASE = 0x500C6000UL;
constexpr uint32_t QDEC20_BASE = 0x500E0000UL;
constexpr uint32_t QDEC21_BASE = 0x500E1000UL;
constexpr uint32_t SPIS21_BASE = 0x500C7000UL;
constexpr uint32_t TIMER21_BASE = 0x500CB000UL;
constexpr uint32_t TIMER22_BASE = 0x500CC000UL;
constexpr uint32_t TIMER23_BASE = 0x500CD000UL;
constexpr uint32_t TIMER24_BASE = 0x500CE000UL;
constexpr uint32_t TIMER10_BASE = 0x50085000UL;
constexpr uint32_t TIMER20_BASE = 0x500CA000UL;
constexpr uint32_t GPIOTE20_BASE = 0x500DA000UL;
constexpr uint32_t GPIOTE30_BASE = 0x5010C000UL;
constexpr uint32_t TEMP_BASE = 0x500D7000UL;
constexpr uint32_t RADIO_BASE = 0x5008A000UL;
constexpr uint32_t MEMCONF_BASE = 0x500CF000UL;
constexpr uint32_t GRTC_BASE = 0x500E2000UL;
constexpr uint32_t TAMPC_BASE = 0x500DC000UL;
constexpr uint32_t WDT31_BASE = 0x50109000UL;
constexpr uint32_t POWER_BASE = 0x5010E000UL;
constexpr uint32_t RESET_BASE = 0x5010E000UL;
constexpr uint32_t REGULATORS_BASE = 0x50120000UL;
#endif

// CPUAPP-side VPR and CTRLAPPERI access is exposed through the non-secure
// aliases on nRF54L15, even when the current Arduino runtime itself is built
// in the secure world. Using the secure aliases from app code can fault/hang
// the application before the VPR transport even starts.
constexpr uint32_t VPR_BASE = 0x4004C000UL;
constexpr uint32_t CTRLAPPERI_BASE = 0x40052000UL;

constexpr uint32_t PSEL_DISCONNECTED = 0xFFFFFFFFUL;

inline constexpr uint32_t make_psel(uint8_t port, uint8_t pin) {
  return (static_cast<uint32_t>(pin) & 0x1FUL) |
         ((static_cast<uint32_t>(port) & 0x7UL) << 5U);
}

namespace gpio {
constexpr uint32_t OUT = 0x000;
constexpr uint32_t OUTSET = 0x004;
constexpr uint32_t OUTCLR = 0x008;
constexpr uint32_t IN = 0x00C;
constexpr uint32_t DIR = 0x010;
constexpr uint32_t DIRSET = 0x014;
constexpr uint32_t DIRCLR = 0x018;
constexpr uint32_t PIN_CNF = 0x080;

// PIN_CNF bit fields (from GPIO.PIN_CNF[n] table).
constexpr uint32_t PIN_CNF_DIR_Pos = 0;
constexpr uint32_t PIN_CNF_INPUT_Pos = 1;
constexpr uint32_t PIN_CNF_PULL_Pos = 2;
constexpr uint32_t PIN_CNF_DRIVE0_Pos = 8;
constexpr uint32_t PIN_CNF_DRIVE1_Pos = 10;
constexpr uint32_t PIN_CNF_SENSE_Pos = 16;
constexpr uint32_t PIN_CNF_CTRLSEL_Pos = 28;

constexpr uint32_t PIN_CNF_DIR_Msk = 0x1UL << PIN_CNF_DIR_Pos;
constexpr uint32_t PIN_CNF_INPUT_Msk = 0x1UL << PIN_CNF_INPUT_Pos;
constexpr uint32_t PIN_CNF_PULL_Msk = 0x3UL << PIN_CNF_PULL_Pos;
constexpr uint32_t PIN_CNF_DRIVE0_Msk = 0x3UL << PIN_CNF_DRIVE0_Pos;
constexpr uint32_t PIN_CNF_DRIVE1_Msk = 0x3UL << PIN_CNF_DRIVE1_Pos;

constexpr uint32_t PULL_DISABLED = 0;
constexpr uint32_t PULL_DOWN = 1;
constexpr uint32_t PULL_UP = 3;

constexpr uint32_t DRIVE0_S0 = 0;
constexpr uint32_t DRIVE1_D1 = 2;
}  // namespace gpio

namespace spim {
constexpr uint32_t TASKS_START = 0x000;
constexpr uint32_t TASKS_STOP = 0x004;
constexpr uint32_t EVENTS_STARTED = 0x100;
constexpr uint32_t EVENTS_STOPPED = 0x104;
constexpr uint32_t EVENTS_END = 0x108;
constexpr uint32_t EVENTS_DMA_RX_END = 0x14C;
constexpr uint32_t EVENTS_DMA_TX_END = 0x168;

constexpr uint32_t ENABLE = 0x500;
constexpr uint32_t PRESCALER = 0x52C;
constexpr uint32_t CONFIG = 0x554;
constexpr uint32_t ORC = 0x5C0;

constexpr uint32_t PSEL_SCK = 0x600;
constexpr uint32_t PSEL_MOSI = 0x604;
constexpr uint32_t PSEL_MISO = 0x608;
constexpr uint32_t PSEL_DCX = 0x60C;
constexpr uint32_t PSEL_CSN = 0x610;

constexpr uint32_t DMA_RX_PTR = 0x704;
constexpr uint32_t DMA_RX_MAXCNT = 0x708;
constexpr uint32_t DMA_TX_PTR = 0x73C;
constexpr uint32_t DMA_TX_MAXCNT = 0x740;

constexpr uint32_t ENABLE_DISABLED = 0;
constexpr uint32_t ENABLE_ENABLED = 7;

constexpr uint32_t CONFIG_ORDER_LSB_FIRST = 1U << 0;
constexpr uint32_t CONFIG_CPHA_TRAILING = 1U << 1;
constexpr uint32_t CONFIG_CPOL_ACTIVE_LOW = 1U << 2;
}  // namespace spim

namespace twim {
constexpr uint32_t TASKS_STOP = 0x004;
constexpr uint32_t TASKS_DMA_RX_START = 0x028;
constexpr uint32_t TASKS_DMA_TX_START = 0x050;

constexpr uint32_t EVENTS_STOPPED = 0x104;
constexpr uint32_t EVENTS_ERROR = 0x114;
constexpr uint32_t EVENTS_LASTRX = 0x134;
constexpr uint32_t EVENTS_LASTTX = 0x138;
constexpr uint32_t EVENTS_DMA_RX_END = 0x14C;
constexpr uint32_t EVENTS_DMA_TX_END = 0x168;

constexpr uint32_t ERRORSRC = 0x4C4;
constexpr uint32_t ENABLE = 0x500;
constexpr uint32_t FREQUENCY = 0x524;
constexpr uint32_t ADDRESS = 0x588;

constexpr uint32_t PSEL_SCL = 0x600;
constexpr uint32_t PSEL_SDA = 0x604;

constexpr uint32_t DMA_RX_PTR = 0x704;
constexpr uint32_t DMA_RX_MAXCNT = 0x708;
constexpr uint32_t DMA_TX_PTR = 0x73C;
constexpr uint32_t DMA_TX_MAXCNT = 0x740;

constexpr uint32_t ENABLE_DISABLED = 0;
constexpr uint32_t ENABLE_ENABLED = 6;

constexpr uint32_t FREQUENCY_100K = 0x01980000UL;
constexpr uint32_t FREQUENCY_250K = 0x04000000UL;
constexpr uint32_t FREQUENCY_400K = 0x06400000UL;
constexpr uint32_t FREQUENCY_1000K = 0x0FF00000UL;

constexpr uint32_t ERRORSRC_ALL = 0x7UL;
}  // namespace twim

namespace uarte {
constexpr uint32_t TASKS_DMA_RX_START = 0x028;
constexpr uint32_t TASKS_DMA_RX_STOP = 0x02C;
constexpr uint32_t TASKS_DMA_TX_START = 0x050;
constexpr uint32_t TASKS_DMA_TX_STOP = 0x054;

constexpr uint32_t EVENTS_ERROR = 0x114;
constexpr uint32_t EVENTS_RXTO = 0x124;
constexpr uint32_t EVENTS_TXSTOPPED = 0x130;
constexpr uint32_t EVENTS_DMA_RX_END = 0x14C;
constexpr uint32_t EVENTS_DMA_TX_END = 0x168;

constexpr uint32_t ERRORSRC = 0x480;
constexpr uint32_t ENABLE = 0x500;
constexpr uint32_t BAUDRATE = 0x524;
constexpr uint32_t CONFIG = 0x56C;

constexpr uint32_t PSEL_TXD = 0x604;
constexpr uint32_t PSEL_CTS = 0x608;
constexpr uint32_t PSEL_RXD = 0x60C;
constexpr uint32_t PSEL_RTS = 0x610;

constexpr uint32_t DMA_RX_PTR = 0x704;
constexpr uint32_t DMA_RX_MAXCNT = 0x708;
constexpr uint32_t DMA_RX_AMOUNT = 0x70C;
constexpr uint32_t DMA_TX_PTR = 0x73C;
constexpr uint32_t DMA_TX_MAXCNT = 0x740;

constexpr uint32_t ENABLE_DISABLED = 0;
constexpr uint32_t ENABLE_ENABLED = 8;

constexpr uint32_t BAUD_9600 = 0x00275000UL;
constexpr uint32_t BAUD_115200 = 0x01D60000UL;
constexpr uint32_t BAUD_1M = 0x10000000UL;

constexpr uint32_t CONFIG_HWFC_Pos = 0;
constexpr uint32_t CONFIG_HWFC_Msk = 0x1UL << CONFIG_HWFC_Pos;

constexpr uint32_t ERRORSRC_ALL = 0xFUL;
}  // namespace uarte

namespace saadc {
constexpr uint32_t TASKS_START = 0x000;
constexpr uint32_t TASKS_SAMPLE = 0x004;
constexpr uint32_t TASKS_STOP = 0x008;
constexpr uint32_t TASKS_CALIBRATEOFFSET = 0x00C;

constexpr uint32_t EVENTS_STARTED = 0x100;
constexpr uint32_t EVENTS_END = 0x104;
constexpr uint32_t EVENTS_CALIBRATEDONE = 0x110;
constexpr uint32_t EVENTS_STOPPED = 0x114;

constexpr uint32_t ENABLE = 0x500;
constexpr uint32_t CH_PSELP = 0x510;
constexpr uint32_t CH_PSELN = 0x514;
constexpr uint32_t CH_CONFIG = 0x518;
constexpr uint32_t CH_STRIDE = 0x10;

constexpr uint32_t RESOLUTION = 0x5F0;
constexpr uint32_t OVERSAMPLE = 0x5F4;
constexpr uint32_t SAMPLERATE = 0x5F8;

constexpr uint32_t RESULT_PTR = 0x62C;
constexpr uint32_t RESULT_MAXCNT = 0x630;
constexpr uint32_t RESULT_AMOUNT = 0x634;

constexpr uint32_t NOISESHAPE = 0x654;

constexpr uint32_t ENABLE_DISABLED = 0;
constexpr uint32_t ENABLE_ENABLED = 1;

// CH[n].PSELx fields.
constexpr uint32_t CH_PSEL_PIN_Pos = 0;
constexpr uint32_t CH_PSEL_PORT_Pos = 8;
constexpr uint32_t CH_PSEL_INTERNAL_Pos = 12;
constexpr uint32_t CH_PSEL_CONNECT_Pos = 30;

constexpr uint32_t CH_PSEL_CONNECT_NC = 0;
constexpr uint32_t CH_PSEL_CONNECT_ANALOG = 1;
constexpr uint32_t CH_PSEL_CONNECT_INTERNAL = 2;

// CH[n].CONFIG fields.
constexpr uint32_t CH_CONFIG_GAIN_Pos = 8;
constexpr uint32_t CH_CONFIG_BURST_Pos = 11;
constexpr uint32_t CH_CONFIG_REFSEL_Pos = 12;
constexpr uint32_t CH_CONFIG_MODE_Pos = 15;
constexpr uint32_t CH_CONFIG_TACQ_Pos = 16;
constexpr uint32_t CH_CONFIG_TCONV_Pos = 28;

constexpr uint32_t REFSEL_INTERNAL = 0;
constexpr uint32_t MODE_SINGLE_ENDED = 0;
constexpr uint32_t MODE_DIFFERENTIAL = 1;
constexpr uint32_t CH_CONFIG_BURST_DISABLED = 0;
constexpr uint32_t CH_CONFIG_BURST_ENABLED = 1;

// SAMPLERATE.MODE field.
constexpr uint32_t SAMPLERATE_MODE_Pos = 12;
constexpr uint32_t SAMPLERATE_MODE_TASK = 0;
constexpr uint32_t SAMPLERATE_MODE_TIMER = 1;

constexpr uint32_t OVERSAMPLE_BYPASS = 0;
constexpr uint32_t OVERSAMPLE_2X = 1;
constexpr uint32_t OVERSAMPLE_4X = 2;
constexpr uint32_t OVERSAMPLE_8X = 3;
constexpr uint32_t OVERSAMPLE_16X = 4;
constexpr uint32_t OVERSAMPLE_32X = 5;
constexpr uint32_t OVERSAMPLE_64X = 6;
constexpr uint32_t OVERSAMPLE_128X = 7;
constexpr uint32_t OVERSAMPLE_256X = 8;
constexpr uint32_t NOISESHAPE_DISABLED = 0;
}  // namespace saadc

namespace timer {
constexpr uint32_t TASKS_START = 0x000;
constexpr uint32_t TASKS_STOP = 0x004;
constexpr uint32_t TASKS_COUNT = 0x008;
constexpr uint32_t TASKS_CLEAR = 0x00C;
constexpr uint32_t TASKS_CAPTURE = 0x040;

constexpr uint32_t SUBSCRIBE_START = 0x080;
constexpr uint32_t SUBSCRIBE_STOP = 0x084;
constexpr uint32_t SUBSCRIBE_COUNT = 0x088;
constexpr uint32_t SUBSCRIBE_CLEAR = 0x08C;
constexpr uint32_t SUBSCRIBE_CAPTURE = 0x0C0;

constexpr uint32_t EVENTS_COMPARE = 0x140;
constexpr uint32_t PUBLISH_COMPARE = 0x1C0;

constexpr uint32_t SHORTS = 0x200;
constexpr uint32_t INTENSET = 0x304;
constexpr uint32_t INTENCLR = 0x308;

constexpr uint32_t MODE = 0x504;
constexpr uint32_t BITMODE = 0x508;
constexpr uint32_t PRESCALER = 0x510;
constexpr uint32_t CC = 0x540;
constexpr uint32_t ONESHOTEN = 0x580;

constexpr uint32_t MODE_TIMER = 0;
constexpr uint32_t MODE_COUNTER = 1;

constexpr uint32_t BITMODE_16 = 0;
constexpr uint32_t BITMODE_8 = 1;
constexpr uint32_t BITMODE_24 = 2;
constexpr uint32_t BITMODE_32 = 3;
}  // namespace timer

namespace pwm {
constexpr uint32_t TASKS_STOP = 0x004;
constexpr uint32_t TASKS_NEXTSTEP = 0x008;
constexpr uint32_t TASKS_DMA_SEQ_START = 0x010;
constexpr uint32_t TASKS_DMA_SEQ_STOP = 0x014;

constexpr uint32_t SUBSCRIBE_STOP = 0x084;
constexpr uint32_t SUBSCRIBE_NEXTSTEP = 0x088;
constexpr uint32_t SUBSCRIBE_DMA_SEQ_START = 0x090;

constexpr uint32_t EVENTS_STOPPED = 0x104;
constexpr uint32_t EVENTS_SEQSTARTED = 0x108;
constexpr uint32_t EVENTS_SEQEND = 0x110;
constexpr uint32_t EVENTS_PWMPERIODEND = 0x118;
constexpr uint32_t EVENTS_LOOPSDONE = 0x11C;
constexpr uint32_t EVENTS_RAMUNDERFLOW = 0x120;
constexpr uint32_t EVENTS_DMA_SEQ_END = 0x124;
constexpr uint32_t EVENTS_COMPAREMATCH = 0x13C;

constexpr uint32_t PUBLISH_STOPPED = 0x184;
constexpr uint32_t PUBLISH_SEQSTARTED = 0x188;
constexpr uint32_t PUBLISH_SEQEND = 0x190;
constexpr uint32_t PUBLISH_PWMPERIODEND = 0x198;
constexpr uint32_t PUBLISH_LOOPSDONE = 0x19C;
constexpr uint32_t PUBLISH_RAMUNDERFLOW = 0x1A0;
constexpr uint32_t PUBLISH_COMPAREMATCH = 0x1BC;

constexpr uint32_t SHORTS = 0x200;
constexpr uint32_t INTEN = 0x300;
constexpr uint32_t INTENSET = 0x304;
constexpr uint32_t INTENCLR = 0x308;
constexpr uint32_t INTPEND = 0x30C;
constexpr uint32_t ENABLE = 0x500;
constexpr uint32_t MODE = 0x504;
constexpr uint32_t COUNTERTOP = 0x508;
constexpr uint32_t PRESCALER = 0x50C;
constexpr uint32_t DECODER = 0x510;
constexpr uint32_t LOOP = 0x514;
constexpr uint32_t IDLEOUT = 0x518;
constexpr uint32_t SEQ_REFRESH = 0x528;
constexpr uint32_t SEQ_ENDDELAY = 0x52C;
constexpr uint32_t PSEL_OUT = 0x560;
constexpr uint32_t DMA_SEQ_PTR = 0x704;
constexpr uint32_t DMA_SEQ_MAXCNT = 0x708;
constexpr uint32_t DMA_SEQ_AMOUNT = 0x70C;
constexpr uint32_t DMA_SEQ_CURRENTAMOUNT = 0x710;
constexpr uint32_t DMA_SEQ_TERMINATEONBUSERROR = 0x71C;
constexpr uint32_t DMA_SEQ_BUSERRORADDRESS = 0x720;
constexpr uint32_t DMA_SEQ_STRIDE = 0x024;
constexpr uint32_t REGISTER_STRIDE = sizeof(uint32_t);

constexpr uint32_t ENABLE_DISABLED = 0;
constexpr uint32_t ENABLE_ENABLED = 1;

constexpr uint32_t MODE_UP = 0;
constexpr uint32_t MODE_UPDOWN = 1;

constexpr uint32_t DECODER_LOAD_COMMON = 0;
constexpr uint32_t DECODER_LOAD_GROUPED = 1;
constexpr uint32_t DECODER_LOAD_INDIVIDUAL = 2;
constexpr uint32_t DECODER_LOAD_WAVEFORM = 3;

constexpr uint32_t DECODER_MODE_REFRESHCOUNT = 0;
constexpr uint32_t DECODER_MODE_NEXTSTEP = 1;
}  // namespace pwm

namespace gpiote {
constexpr uint32_t TASKS_OUT = 0x000;
constexpr uint32_t TASKS_SET = 0x030;
constexpr uint32_t TASKS_CLR = 0x060;

constexpr uint32_t SUBSCRIBE_OUT = 0x080;
constexpr uint32_t SUBSCRIBE_SET = 0x0B0;
constexpr uint32_t SUBSCRIBE_CLR = 0x0E0;

constexpr uint32_t EVENTS_IN = 0x100;
constexpr uint32_t EVENTS_PORT_NONSECURE = 0x140;

constexpr uint32_t INTENSET0 = 0x304;
constexpr uint32_t INTENCLR0 = 0x308;

constexpr uint32_t CONFIG = 0x510;

constexpr uint32_t CONFIG_MODE_Pos = 0;
constexpr uint32_t CONFIG_PSEL_Pos = 4;
constexpr uint32_t CONFIG_PORT_Pos = 9;
constexpr uint32_t CONFIG_POLARITY_Pos = 16;
constexpr uint32_t CONFIG_OUTINIT_Pos = 20;

constexpr uint32_t MODE_DISABLED = 0;
constexpr uint32_t MODE_EVENT = 1;
constexpr uint32_t MODE_TASK = 3;

constexpr uint32_t POLARITY_NONE = 0;
constexpr uint32_t POLARITY_LOTOHI = 1;
constexpr uint32_t POLARITY_HITOLO = 2;
constexpr uint32_t POLARITY_TOGGLE = 3;
}  // namespace gpiote

namespace dppic {
constexpr uint32_t CHEN = 0x500;
constexpr uint32_t CHENSET = 0x504;
constexpr uint32_t CHENCLR = 0x508;

inline constexpr uint32_t configValue(uint8_t channel) {
  return static_cast<uint32_t>(channel) | (1UL << 31U);
}
}  // namespace dppic

}  // namespace nrf54l15
